<template>
  <div class="sec-account-trade-caliber">
    <ul>
      <li>
        <p>
          1．	统计包含所有品种，竞价交易与大宗交易数据。
        </p>
      </li>
      <li>
        <p>
          2．	结果展示的时间格式为：HH:MM:SS。
        </p>
      </li>
      <li>
        <p>
          3．	表格1、2只统计发生委托交易的营业部及账户的汇总数据记录。
        </p>
      </li>
      <li>
        <p>
          4．	结果列表中的“营业部名称”字段由“会员名称”和“营业部名称”拼接而成，如：“爱建证券有限责任公司——嘉兴斜西街证券营业部”。
        </p>
      </li>
      <li>
        <p>
          5．	在统计时，“营业部名称”字段的值基于委托成交明细数据中的Stat_Seat_Code（虚拟PBU）来确定。如果某一个股东账户在同一交易日内的明细数据中出现了不同的Stat_Seat_Code，则统计在不同的营业部数据内。相应表格3也只显示下钻条件所限定的营业部内该账户的明细数据。
        </p>
      </li>
      <li>
        <p>
          6．	表格1中账户总数为统计日期时间段内不同编码账户代码个数。
        </p>
      </li>
      <li>
        <p>
          7．	表格1、2中平均价为加权平均价：∑(数量*价格）/∑(数量)，保留3位小数精度。
        </p>
      </li>
      <li>
        <p>
          8．	计算平均委托价时，对于特殊订单的申报价格处理方式如下：
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'L'（限价订单），则以订单价格作为申报价格。
          </span>
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'M'（市价订单）且部分成交或完全成交，则以该订单与对手方撮合的第一笔成交记录的成交价格作为申报价格。
          </span>
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'M'（市价订单）且未发生任何成交，则以该订单进入订单簿前的该证券最近一笔成交记录的成交价格作为申报价格，如果该证券之前没有任何成交记录，则以昨收盘价作为申报价格。
          </span>
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'T'（市价转限价订单）且部分成交或完全成交，则以该订单与对手方撮合的第一笔成交记录的成交价格作为申报价格。
          </span>
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'T'（市价转限价订单）且未发生任何成交，则以该订单进入订单簿后转为限价订单的订单价格作为申报价格，如果该证券之前没有任何成交记录，则以昨收盘价作为申报价格。
          </span>
        </p>
      </li>
      <li>
        <p>
          9．	表格3中某个账户的订单与其对应的撤单、交易的关系通过日期与订单编号识别。
        </p>
      </li>
      <li>
        <p>
          10．	表格3中订单价格以原始系统申报价格为准。
        </p>
      </li>
      <li>
        <p>
          11．	表格3中成交标志包含3类：未成交、部分成交、完全成交。
        </p>
      </li>
    </ul>
    <h2>最新市场价</h2>
    <ul>
      <li>
        <p>
          1． 统计包含所有品种，只展示连续竞价交易数据（每日9:30至15:00）。
        </p>
      </li>
      <li>
        <p>
          2． 结果展示的时间格式为：HH:MM:SS。
        </p>
      </li>
      <li>
        <p>
          3． 结果集展示委托明细数据。
        </p>
      </li>
      <li>
        <p>
          4． 结果列表中的“营业部名称”字段由“会员名称”和“营业部名称”拼接而成，如：“爱建证券有限责任公司——嘉兴斜西街证券营业部”。
        </p>
      </li>
      <li>
        <p>
          5． 在统计时，“营业部名称”字段的值基于委托成交明细数据中的Stat_Seat_Code（虚拟PBU）来确定。
        </p>
      </li>
      <li>
        <p>
          6． 某个账户的一笔订单与其对应的撤单、交易的关系通过日期与订单编号识别。
        </p>
      </li>
      <li>
        <p>
          7． 订单价格以原始系统申报价格为准。
        </p>
      </li>
      <li>
        <p>
          8． 成交标志包含3类：未成交、部分成交、完全成交。
        </p>
      </li>
      <li>
        <p>
          9． 订单时间之前的最后一笔市场成交价指标，取连续竞价交易记录中交易时间小于本笔订单微秒级时间，交易编号最大记录的成交价格。如无对应连续竞价的交易记录，则取集合竞价阶段的成交价格，如仍无竞价阶段的成交价格，则取行情中昨日收盘价。
        </p>
      </li>
      <li>
        <p>
          10． 订单时间之前的最后一秒市场平均成交价指标，计算数据范围取该笔订单微秒级时间前一秒内所有的交易记录的平均成交价：∑(成交金额) / ∑(成交数量)，保留3位小数精度。如没有平均成交价，则倒推一秒，直至计算出结果。如倒推至9:30仍无价格，则取集合竞价成交价格，如仍无价格，则取行情中昨日收盘价。
        </p>
      </li>
    </ul>
    <h2>档位分析</h2>
    <ul>
      <li>
        <p>
          1． 统计包含所有品种，只展示连续竞价订单数据（每日9:30至15:00）。计算档位时需同时使用集合竞价的订单。
        </p>
      </li>
      <li>
        <p>
          2． 结果展示的时间格式为：HH:MM:SS。
        </p>
      </li>
      <li>
        <p>
          3． 申报后订单所在档位：
        </p>
        <div>
          <el-table
            :data="tableData1"
            border
            size="small"
            style="width: 100%;">
            <el-table-column
              v-for="(item, index) in columns1"
              align="center"
              :key="index"
              :label="item.label"
              :prop="item.field">
            </el-table-column>
          </el-table>
        </div>
      </li>
      <li>
        <p>
          4． 撤单前所在档位：该笔订单在撤单时点前订单簿中所在价格档位（订单簿订单范围：本笔订单微秒级撤单时间前申报的有效订单）。如本笔订单没有撤单记录，则撤单前所在档位为空。
        </p>
      </li>
      <li>
        <p>
          5． 相同价格剩余委托：对应申报后订单所在档位的剩余委托量。如档位为空，则该值为0
        </p>
      </li>
      <li>
        <p>
          6． 买一、买五、买前五、等：分别对应申报后订单簿中方向为买的第一档、第五档、前五档。
        </p>
      </li>
      <li>
        <p>
          7． 撤单买一、撤单买五、撤单买前五、等：分别对应撤单前的订单簿中方向为买的第一档、第五档、前五档。如本笔订单没有撤单记录，则为收盘时刻对应档位剩余委托数量。
        </p>
      </li>
      <li>
        <p>
          8． 平均价：∑(剩余数量 * 价格) / ∑(剩余数量) ，保留3位小数精度。
        </p>
      </li>
      <li>
        <p>
          9． 委托时刻前的市场未成交买单：申报时点的订单簿中向为买的剩余委托数量。
        </p>
      </li>
      <li>
        <p>
          10． 委托时刻前的市场未成交卖单：申报时点的订单簿中向为卖的剩余委托数量。
        </p>
      </li>
      <li>
        <p>
          11． 撤单时刻前的市场未成交买单：撤单时点的订单簿中向为买的剩余委托数量。如本笔订单没有撤单记录，则为收盘时刻剩余委托数量。
        </p>
      </li>
      <li>
        <p>
          12． 撤单时刻前的市场未成交卖单：撤单时点的订单簿中向为卖的剩余委托数量。如本笔订单没有撤单记录，则为收盘时刻剩余委托数量。
        </p>
      </li>
    </ul>
    <h2>时间片分析</h2>
    <ul>
      <li>
        <p>
          1． 统计包含所有品种，竞价交易与大宗交易数据。
        </p>
      </li>
      <li>
        <p>
          2． 注意区间选择，开闭区间。
        </p>
      </li>
      <li>
        <p>
          3． 图形界面中符合条件的日期时间区间，每分钟为一个折线刻度。平均成交价、交易量为主界面限定股票的全市场成交汇总数据，交易量指标买卖按单边计算。
        </p>
      </li>
      <li>
        <p>
          4． 表格结果列表中的“营业部名称”字段由“会员名称”和“营业部名称”拼接而成，如：“爱建证券有限责任公司——嘉兴斜西街证券营业部”。
        </p>
      </li>
      <li>
        <p>
          5． 在统计时，“营业部名称”字段的值基于委托成交明细数据中的Stat_Seat_Code（虚拟PBU）来确定。如果某一个股东账户在同一交易日内的明细数据中出现了不同的Stat_Seat_Code，则统计在不同的营业部数据内。
        </p>
      </li>
      <li>
        <p>
          6． 委托、成交、撤单相应指标计算查询输入的时间区间全市场汇总数据。
        </p>
      </li>
      <li>
        <p>
          7． 平均价：∑(数量 * 价格)/ ∑(数量) ，保留3位小数精度。
        </p>
      </li>
      <li>
        <p>
          8． 计算平均委托价时，对于特殊订单的申报价格处理方式如下：
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'L'（限价订单），则以订单价格作为申报价格。
          </span>
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'M'（市价订单）且部分成交或完全成交，则以该订单与对手方撮合的第一笔成交记录的成交价格作为申报价格。
          </span>
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'M'（市价订单）且未发生任何成交，则以该订单进入订单簿前的该证券最近一笔成交记录的成交价格作为申报价格，如果该证券之前没有任何成交记录，则以昨收盘价作为申报价格。
          </span>
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'T'（市价转限价订单）且部分成交或完全成交，则以该订单与对手方撮合的第一笔成交记录的成交价格作为申报价格。
          </span>
          <span>
            <i class="fa fa-asterisk"></i>如果订单类型为'T'（市价转限价订单）且未发生任何成交，则以该订单进入订单簿后转为限价订单的订单价格作为申报价格，如果该证券之前没有任何成交记录，则以昨收盘价作为申报价格。
          </span>
        </p>
      </li>
      <li>
        <p>
          9． 占比为表格中相应粒度指标占全市场的比例。如“买账户汇总”的买委托占比指标 = 某账户该股票买委托量 / 该股票全市场买委托量。
        </p>
      </li>
      <li>
        <p>
          10． 净买入量：买入量 – 卖出量。净卖出量：卖出量 – 买入量。
        </p>
      </li>
      <li>
        <p>
          11． 成交账户数：以账户代码区分，不同的账户代码分别记为1人。
        </p>
      </li>
      <li>
        <p>
          12． 账户类型分类包含：自然人、一般法人、机构、融资融券账户、历史基金账户。
        </p>
      </li>
    </ul>
    <h2>集合竞价</h2>
    <ul>
      <li>
        <p>
          1． 统计包含所有品种，集合竞价阶段订单数据（9:15至9:25）。
        </p>
      </li>
      <li>
        <p>
          2． 除该账户的撮合的有效订单范围：整个集合竞价交易阶段所有未撤销（截至9:25:00整）订单，并剔除本笔订单对应的账户代码的所有申报订单。
        </p>
      </li>
      <li>
        <p>
          3． 该委托前一秒的撮合的有效订单范围：集合竞价开始至该笔订单时间的前一秒（不带小数的秒级时间，如订单时间9:20:01对应为9:20:00）所有有效订单。如订单时间为9:15:00，则无订单。
        </p>
      </li>
      <li>
        <p>
          4． 该委托后一秒的撮合的有效订单范围：集合竞价开始至该笔订单时间的后一秒（不带小数的秒级时间，如订单时间9:20:01对应为9:20:02）所有订单。
        </p>
      </li>
      <li>
        <p>
          5． 该委托撤单前的撮合的有效订单范围：集合竞价开始至该笔订单撤单时间的前一秒（不带小数的秒级时间，如撤单时间9:20:01对应为9:20:00）所有有效订单。如撤单时间为9:15:00，则无订单。如该订单集合竞价阶段未撤单，则订单为整个集合竞价交易阶段所有有效订单。
        </p>
      </li>
      <li>
        <p>
          6． 该委托撤单后的撮合的有效订单范围：集合竞价开始至该笔订单撤单时间的后一秒（不带小数的秒级时间，如撤单时间9:20:01对应为9:20:02）所有订单。如该订单集合竞价阶段未撤单，则订单为整个集合竞价交易阶段所有有效订单。
        </p>
      </li>
      <li>
        <p>
          7． 撮合需根据指标选定的时间段内有效订单（没有撤单）进行计算。
        </p>
      </li>
      <li>
        <p>
          8． 中间价取价格清单中多个价格的平均价格，平均价格精度保留至最小价格变动单位（A股、债券、债券买断式回购：人民币0.01元；基金、权证：人民币0.001元；债券质押式回购：人民币0.005元；B股：美元0.001元）。
        </p>
      </li>
    </ul>
    <h2>虚拟集合竞价</h2>
    <ul>
      <li>
        <p>
          1． 统计包含所有品种，集合竞价阶段订单数据（9:15至9:25）。
        </p>
      </li>
      <li>
        <p>
          2． 结果展示的时间格式为：HH:MM:SS。
        </p>
      </li>
      <li>
        <p>
          3． “时间”：根据间隔秒数确定每个“时间”，如间隔秒数设定为3，且输入的开始时间为9:15:00，则“时间”顺序清单为9:15:00、9:15:03、9:15:06、9:15:09…、9:25:00。
        </p>
      </li>
      <li>
        <p>
          4． 时间统计区间：每个“时间”的统计区间为集合竞价阶段开始至该时间初。例如：9:15:06 表示 09:15:06 前订单簿的情况（时间间隔3秒），时间统计区间为9:15:00.000000至9:15:06.000000。最后一个“时间”的统计区间截至查询输入的结束时间（默认9:25:00）。
        </p>
      </li>
      <li>
        <p>
          5． 虚拟撮合的订单范围：所在“时间”的时间统计区间内，提交的有效订单（截至该“时间”没有撤单）。
        </p>
      </li>
      <li>
        <p>
          6． 撮合规则与集合竞价子模块一致。
        </p>
      </li>
      <li>
        <p>
          7． 与虚拟撮合价的最近两个价格的偏差：该指标只有在撮合计算过程中，需要取价格清单中多个价格的中间价时才有值，否则为0。将价格清单中价格按与虚拟撮合价差值的绝对值“ABS（该价格 - 虚拟撮合价）”由小到大排序，取排名1和2的价格之差的绝对值。如下表格：
        </p>
        <div>
          <el-table
            :data="tableData2"
            border
            size="small"
            style="width: 100%;">
            <el-table-column
              v-for="(item, index) in columns2"
              align="center"
              :key="index"
              :label="item.label"
              :prop="item.field">
            </el-table-column>
          </el-table>
          <p class="sec-title">
            则与虚拟撮合价的最近两个价格的偏差为ABS(1.02元 - 1.03元)或者ABS(1.02元 - 1.01元)，结果为0.01元。
          </p>
        </div>
      </li>
    </ul>
    <h2>持有占比</h2>
    <ul>
      <li>
        <p>
          1． 只计算可流通沪市A股持有数据。
        </p>
      </li>
      <li>
        <p>
          2． 市值 = 持仓数量 * 当天行情该股收盘价（如当天行情收盘价为0，取昨收盘价）。
        </p>
      </li>
      <li>
        <p>
          3． 结果按每个账户、每个交易日，显示主界面限定的股票的持有市值与占比情况。
        </p>
      </li>
      <li>
        <p>
          4． 账户持有该股票占比其所持股票的市值 = 账户持有这个股票的市值 / 账户持有市值总额。
        </p>
      </li>
    </ul>
    <h2>成交回放</h2>
    <ul>
      <li>
        <p>
          1．	本应用仅支持展示2009-11-23及以后的数据。
        </p>
      </li>
      <li>
        <p>
          2．	统计时仅包含竞价系统的订单、成交数据，不含大宗交易、固收平台及其它系统的成交数据。
        </p>
      </li>
      <li>
        <p>
          3．	结果列表中的“会员营业部名称”字段由“会员名称”和“营业部名称”拼接而成，如：“中国国际金融有限公司北京建国门外大街证券营业部”。
        </p>
      </li>
      <li>
        <p>
          4．	根据“Stat_Seat_Code”获取得到的会员营业部信息包含基金及非会员（基金、非会员都不还原为出租PBU的会员）。这与市场监察部当前使用的“席位与会员营业部对应关系数据”的口径一致。
        </p>
      </li>
    </ul>
  </div>
</template>

<script>

export default {
  components: {
  },
  data() {
    return {
      tableData1: [
        {
          aDol1: '即时完全成交',
          aDol2: '空',
          aDol3: '订单数量等于成交数量'
        },
        {
          aDol1: '未完全成交、且没有自动撤单',
          aDol2: '对应申报时点订单簿中与其买卖方向一致、价格一致的档位',
          aDol3: '订单数量不等于成交数量，且订单价格不为0'
        },
        {
          aDol1: '系统自动撤单',
          aDol2: '空',
          aDol3: '为市价订单，且订单数量大于成交数量为市价转限价订单，且订单价格为0，且订单数量大于成交数量'
        }
      ],
      columns1: [
        {id: 'aCaliber1', label: '订单状态', field: 'aDol1'},
        {id: 'aCaliber2', label: '申报所在档位', field: 'aDol2'},
        {id: 'aCaliber3', label: '判断方式', field: 'aDol3'}
      ],
      tableData2: [
        {
          bDol1: '1.01元',
          bDol2: '1.02元',
          bDol3: '0.01',
          bDol4: '2'
        },
        {
          bDol1: '1.02元',
          bDol2: '1.02元',
          bDol3: '0',
          bDol4: '1'
        },
        {
          bDol1: '1.03元',
          bDol2: '1.02元',
          bDol3: '0.01',
          bDol4: '2'
        }
      ],
      columns2: [
        {id: 'bCaliber1', label: '价格', field: 'bDol1'},
        {id: 'bCaliber2', label: '虚拟撮合价', field: 'bDol2'},
        {id: 'bCaliber3', label: '价格差值', field: 'bDol3'},
        {id: 'bCaliber4', label: '排序', field: 'bDol4'}
      ]
    }
  }
}
</script>

<style lang="less" scoped>
  .sec-account-trade-caliber {
    p {
      font-size: 16px;
      line-height: 30px;
      margin: 4px 0;
      span {
        display: block;
        padding-left: 26px;
        .fa {
          font-size: 12px;
          margin-right: 8px;
        }
      }
    }
    .sec-title {
      margin: 0;
      padding-left: 20px;
    }
    h2 {
      margin: 5px 0;
      font-size: 16px;
      font-weight: bold;
    }
  }
</style>
